### Lab | SQL Queries 9

#### Instructions
Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

In [31]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass  # To get the password without showing the input

In [58]:
import sqlalchemy
sqlalchemy.__version__

'1.3.23'

In [59]:
import pymysql
pymysql.__version__

'1.0.2'

In [60]:
import pandas
pandas.__version__

'1.2.3'

In [32]:
password = getpass.getpass()

········

In [36]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

#### 1. How many distinct (different) actors' last names are there?

In [37]:
query= '''SELECT COUNT(last_name) FROM sakila.actor;'''
df = pd.read_sql_query(query, engine)
df.head()

   COUNT(last_name)
0               200

#### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [38]:
query= '''SELECT *, WEEKDAY(rental_date) AS 'Weekday',
CASE
WHEN (WEEKDAY(rental_date) >  4 ) then 'weekend'
ELSE 'workday'
END AS day_type
FROM sakila.rental;'''
df = pd.read_sql_query(query, engine)
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,Weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,1,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,1,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,1,workday

#### 3. Get all films with ARMAGEDDON in the title.

In [61]:
# This will only work with pandas version 1.1.3
query= '''SELECT * FROM sakila.film
WHERE title LIKE'\%ARMAGEDDON\%';'''
df = pd.read_sql_query(query, engine)
df.head()

ValueError: unsupported format character 'A' (0x41) at index 45

#### 4. Get 10 the longest films.

In [42]:
query= '''SELECT * FROM sakila.film
ORDER BY length ASC
LIMIT 10;'''
df = pd.read_sql_query(query, engine)
df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,15,ALIEN CENTER,A Brilliant Drama of a Cat And a Mad Scientist...,2006,1,None,5,2.99,46,10.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
1,504,KWAI HOMEWARD,A Amazing Drama of a Car And a Squirrel who mu...,2006,1,None,5,0.99,46,25.99,PG-13,"Trailers,Commentaries",2006-02-15 05:03:42
2,469,IRON MOON,A Fast-Paced Documentary of a Mad Cow And a Bo...,2006,1,None,7,4.99,46,27.99,PG,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
3,730,RIDGEMONT SUBMARINE,A Unbelieveable Drama of a Waitress And a Comp...,2006,1,None,3,0.99,46,28.99,PG-13,"Commentaries,Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
4,505,LABYRINTH LEAGUE,A Awe-Inspiring Saga of a Composer And a Frisb...,2006,1,None,6,2.99,46,24.99,PG-13,"Commentaries,Behind the Scenes",2006-02-15 05:03:42

#### 5. How many films include Behind the Scenes content?

In [46]:
query= '''SELECT COUNT(film_id)
FROM sakila.film
WHERE special_features LIKE '%Behind_the_Scenes%';'''
df = pd.read_sql_query(query, engine)
df.head()

   COUNT(film_id)
0               0

#### 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [44]:
query= '''SELECT AVG(length) AS average, rating
FROM sakila.film
GROUP BY rating
HAVING average>120;'''
df = pd.read_sql_query(query, engine)
df.head()

    average rating
0  120.4439  PG-13

#### 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [45]:
query= '''SELECT title,length,rental_rate FROM sakila.film
WHERE (length IS NOT NULL)
ORDER BY length ASC;'''
df = pd.read_sql_query(query, engine)
df.head()

                 title  length  rental_rate
0         ALIEN CENTER      46         2.99
1            IRON MOON      46         4.99
2        KWAI HOMEWARD      46         0.99
3     LABYRINTH LEAGUE      46         2.99
4  RIDGEMONT SUBMARINE      46         0.99